pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/SYS_1.0.xml
<module id="SYS" HW_revision="1.0">
    <register id="SYSCTL" width="16" offset="0x0" internal="0" description="System Control">
        <bitfield id="SYSRIVECT" description="RAM-based interrupt vectors" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="FRAM" value="0x0" description="Interrupt vectors generated with end address TOP of lower 64K FRAM FFFFh"/>
            <bitenum id="RAM" value="0x1" description="Interrupt vectors generated with end address TOP of RAM, when RAM available"/>
        </bitfield>
        <bitfield id="SYSPMMPE" description="PMM access protect" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Access from anywhere in memory"/>
            <bitenum id="EN" value="0x1" description="Access only from the BSL segments"/>
        </bitfield>
        <bitfield id="SYSBSLIND" description="BSL entry indication" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="No BSL entry sequence detected"/>
            <bitenum id="SET" value="0x1" description="BSL entry sequence detected"/>
        </bitfield>
        <bitfield id="SYSJTAGPIN" description="Dedicated JTAG pins enable" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="SHARED" value="0x0" description="Shared JTAG pins (JTAG mode selectable using SBW sequence)"/>
            <bitenum id="DEDICATED" value="0x1" description="Dedicated JTAG pins (explicit 4-wire JTAG mode selection)"/>
        </bitfield>
    </register>
    <register id="SYSBSLC" width="16" offset="0x2" internal="0" description="Bootloader Configuration">
        <bitfield id="SYSBSLR" description="RAM assigned to BSL" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NORAM" value="0x0" description="No RAM assigned to BSL area"/>
            <bitenum id="RAM" value="0x1" description="Lowest 16 bytes of RAM assigned to BSL"/>
        </bitfield>
        <bitfield id="SYSBSLOFF" description="Bootstrap loader memory disable for the size covered in SYSBSLSIZE" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="ON" value="0x0" description="BSL memory is addressed when this area is read."/>
            <bitenum id="OFF" value="0x1" description="BSL memory behaves like vacant memory. Reads cause 3FFFh to be read. Fetches cause JMP $ to be executed."/>
        </bitfield>
        <bitfield id="SYSBSLPE" description="Bootstrap loader memory protection enable for the size covered in SYSBSLSIZE. By default, this bit is cleared by hardware with a BOR event (as indicated above); however, the boot code that checks for an available BSL may set this bit in software to protect the BSL. Because devices normally come with a TI BSL preprogrammed and protected, the boot code sets this bit." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="NOTPROT" value="0x0" description="Area not protected. Read, program, and erase of BSL memory is possible."/>
            <bitenum id="PROT" value="0x1" description="Area protected"/>
        </bitfield>
    </register>
    <register id="SYSJMBC" width="16" offset="0x6" internal="0" description="JTAG Mailbox Control">
        <bitfield id="JMBIN0FG" description="Incoming JTAG Mailbox 0 flag" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NODAT" value="0x0" description="JMBI0 has no new data"/>
            <bitenum id="NEWDAT" value="0x1" description="JMBI0 has new data available"/>
        </bitfield>
        <bitfield id="JMBIN1FG" description="Incoming JTAG Mailbox 1 flag" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NODAT" value="0x0" description="JMBI1 has no new data"/>
            <bitenum id="NEWDAT" value="0x1" description="JMBI1 has new data available"/>
        </bitfield>
        <bitfield id="JMBOUT0FG" description="Outgoing JTAG Mailbox 0 flag" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="BUSY" value="0x0" description="JMBO0 is not ready to receive new data"/>
            <bitenum id="READY" value="0x1" description="JMBO0 is ready to receive new data"/>
        </bitfield>
        <bitfield id="JMBOUT1FG" description="Outgoing JTAG Mailbox 1 flag" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="BUSY" value="0x0" description="JMBO1 is not ready to receive new data"/>
            <bitenum id="READY" value="0x1" description="JMBO1 is ready to receive new data"/>
        </bitfield>
        <bitfield id="JMBMODE" description="Operation mode of JMB" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="16BIT" value="0x0" description="16-bit transfers using JMBO0 and JMBI0 only"/>
            <bitenum id="32BIT" value="0x1" description="32-bit transfers using JMBO0 with JMBO1 and JMBI0 with JMBI1"/>
        </bitfield>
        <bitfield id="JMBCLR0OFF" description="Incoming JTAG Mailbox 0 flag auto-clear disable" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="CLRORD" value="0x0" description="JMBIN0FG cleared on read of JMB0IN register"/>
            <bitenum id="CLRBSW" value="0x1" description="JMBIN0FG cleared by software"/>
        </bitfield>
        <bitfield id="JMBCLR1OFF" description="Incoming JTAG Mailbox 1 flag auto-clear disable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="CLRORD" value="0x0" description="JMBIN1FG cleared on read of JMB1IN register"/>
            <bitenum id="CLRBSW" value="0x1" description="JMBIN1FG cleared by software"/>
        </bitfield>
    </register>
    <register id="SYSJMBI0" width="16" offset="0x8" internal="0" description="JTAG Mailbox Input 0">
        <bitfield id="MSGLO" description="JTAG mailbox incoming message low byte" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="MSGHI" description="JTAG mailbox incoming message high byte" begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="SYSJMBI1" width="16" offset="0xA" internal="0" description="JTAG Mailbox Input 1">
        <bitfield id="MSGLO" description="JTAG mailbox incoming message low byte" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="MSGHI" description="JTAG mailbox incoming message high byte" begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="SYSJMBO0" width="16" offset="0xC" internal="0" description="JTAG Mailbox Output 0">
        <bitfield id="MSGLO" description="JTAG mailbox outgoing message low byte" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="MSGHI" description="JTAG mailbox outgoing message high byte" begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSJMBO1" width="16" offset="0xE" internal="0" description="JTAG Mailbox Output 1">
        <bitfield id="MSGLO" description="JTAG mailbox outgoing message low byte" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="MSGHI" description="JTAG mailbox outgoing message high byte" begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSUNIV" width="16" offset="0x1A" internal="0" description="User NMI Vector Generator">
        <bitfield id="SYSUNIV" description="User NMI vector" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="NMIIFG" value="0x2" description="NMIFG NMI pin or SVSH event"/>
            <bitenum id="OFIFG" value="0x4" description="OFIFG oscillator fault"/>
        </bitfield>
    </register>
    <register id="SYSSNIV" width="16" offset="0x1C" internal="0" description="System NMI Vector Generator">
        <bitfield id="SYSSNIV" description="System NMI vector" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="SVSLIFG" value="0x2" description="SVS low-power reset entry"/>
            <bitenum id="UBDIFG" value="0x4" description="Uncorrectable FRAM bit error detection"/>
            <bitenum id="NONE" value="0x6" description="Reserved"/>
            <bitenum id="NONE" value="0x8" description="Reserved"/>
            <bitenum id="NONE" value="0xA" description="Reserved"/>
            <bitenum id="NONE" value="0xC" description="Reserved"/>
            <bitenum id="NONE" value="0xE" description="Reserved"/>
            <bitenum id="NONE" value="0x10" description="Reserved"/>
            <bitenum id="VMAIFG" value="0x12" description="VMAIFG Vacant memory access"/>
            <bitenum id="JMBINIFG" value="0x14" description="JMBINIFG JTAG mailbox input"/>
            <bitenum id="JMBOUTIFG" value="0x16" description="JMBOUTIFG JTAG mailbox output"/>
            <bitenum id="CBDIFG" value="0x18" description="Correctable FRAM bit error detection"/>
        </bitfield>
    </register>
    <register id="SYSRSTIV" width="16" offset="0x1E" internal="0" description="Reset Vector Generator">
        <bitfield id="SYSRSTIV" description="Reset interrupt vector" begin="15" end="0" width="16" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="BOR" value="0x2" description="Brownout"/>
            <bitenum id="RSTNMI" value="0x4" description="RSTIFG RST/NMI"/>
            <bitenum id="PMMSWBOR" value="0x6" description="PMMSWBOR software BOR"/>
            <bitenum id="LPM5WU" value="0x8" description="LPMx.5 wakeup"/>
            <bitenum id="SECYV" value="0xA" description="Security violation"/>
            <bitenum id="SYSRSTIV_12" value="0xC" description="Reserved"/>
            <bitenum id="SVSHIFG" value="0xE" description="SVSHIFG SVSH event"/>
            <bitenum id="SYSRSTIV_16" value="0x10" description="Reserved"/>
            <bitenum id="SYSRSTIV_18" value="0x12" description="Reserved"/>
            <bitenum id="PMMSWPOR" value="0x14" description="PMMSWPOR software POR"/>
            <bitenum id="WDTIFG" value="0x16" description="WDTIFG watchdog timeout"/>
            <bitenum id="WDTPW" value="0x18" description="WDTPW watchdog password violation"/>
            <bitenum id="FRCTLPW" value="0x1A" description="FRCTLPW password violation"/>
            <bitenum id="UBDIFG" value="0x1C" description="Uncorrectable FRAM bit error detection"/>
            <bitenum id="PERF" value="0x1E" description="Peripheral area fetch"/>
            <bitenum id="PMMPW" value="0x20" description="PMM password violation"/>
            <bitenum id="SYSRSTIV_34" value="0x22" description="Reserved"/>
            <bitenum id="FLLUL" value="0x24" description="FLL unlock (PUC)"/>
        </bitfield>
    </register>
    <register id="SYSCFG0" width="16" offset="0x20" internal="0" description="System Configuration 0">
        <bitfield id="PFWP" description="Program FRAM write protection" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="WEN" value="0x0" description="Program FRAM write enable"/>
            <bitenum id="WPROT" value="0x1" description="Program FRAM write protected (not writable)"/>
        </bitfield>
        <bitfield id="FRWPPW" description="FRWPPW password." begin="15" end="8" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="DFWP" description="Data FRAM write protection" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="WEN" value="0x0" description="Data FRAM write enable"/>
            <bitenum id="WPROT" value="0x1" description="Data FRAM write protected (not writable)"/>
        </bitfield>
        <bitfield id="FRWPOA" description="Program FRAM write protection offset address from the beginning of Program FRAM. The offset increases by 1KB resolution" begin="7" end="2" width="6" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCFG1" width="16" offset="0x22" internal="0" description="System Configuration 1">
        <bitfield id="IREN" description="Infrared enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Infrared function disabled"/>
            <bitenum id="EN" value="0x1" description="Infrared function enabled"/>
        </bitfield>
        <bitfield id="IRPSEL" description="Infrared polarity select" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NORM" value="0x0" description="Normal polarity"/>
            <bitenum id="INV" value="0x1" description="Inverted polarity"/>
        </bitfield>
        <bitfield id="IRMSEL" description="Infrared mode select" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="ASK" value="0x0" description="ASK mode"/>
            <bitenum id="FSK" value="0x1" description="FSK mode"/>
        </bitfield>
        <bitfield id="IRDSSEL" description="Infrared data source select" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="HW" value="0x0" description="From hardware peripherals upon device configuration"/>
            <bitenum id="IRDATA" value="0x1" description="From IRDATA bit"/>
        </bitfield>
        <bitfield id="IRDATA" description="Infrared data" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="Infrared data logic 0"/>
            <bitenum id="HIGH" value="0x1" description="Infrared data logic 1"/>
        </bitfield>
        <bitfield id="SYNCSEL" description="Captivate Conversion triggered Source Selection" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="SYNCSEL_0" value="0x0" description="External source is selected"/>
            <bitenum id="SYNCSEL_1" value="0x1" description="ADC as the source is selected"/>
            <bitenum id="SYNCSEL_2" value="0x2" description="Comparator as the source is selected"/>
            <bitenum id="SYNCSEL_3" value="0x3" description="Reserved"/>
        </bitfield>
    </register>
    <register id="SYSCFG2" width="16" offset="0x24" internal="0" description="System Configuration 2">
        <bitfield id="RTCCKSEL" description="RTC clock selection" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="RTCCKSEL_0" value="0x0" description="SMCLK is selected"/>
            <bitenum id="RTCCKSEL_1" value="0x1" description="ACLK is selected"/>
        </bitfield>
        <bitfield id="USCIB0RMP" description="eUSCI_B0 remapping source selection" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="USCIB0RMP_0" value="0x0" description="Default function. See the device-specific data sheet for details."/>
            <bitenum id="USCIB0RMP_1" value="0x1" description="Remapped function. See the device-specific data sheet for details."/>
        </bitfield>
        <bitfield id="TB0TRGSEL" description="TB0OUTH trigger source selection" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="TB0TRGSEL_0" value="0x0" description="Internal source is selected"/>
            <bitenum id="TB0TRGSEL_1" value="0x1" description="External source is selected"/>
        </bitfield>
    </register>
    <register id="SYSCFG3" width="16" offset="0x26" internal="0" description="System Configuration 3">
        <bitfield id="USCIA0RMP" description="eUSCI_A0 remapping source selection" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="USCIA0RMP_0" value="0x0" description="Default function. See the device-specific data sheet for details."/>
            <bitenum id="USCIA0RMP_1" value="0x1" description="Remapped function. See the device-specific data sheet for details."/>
        </bitfield>
        <bitfield id="TA2RMP" description="Timer2_A3 remapping source selection" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="TA2RMP_0" value="0x0" description="Default function. See the device-specific data sheet for details."/>
            <bitenum id="TA2RMP_1" value="0x1" description="Remapped function. See the device-specific data sheet for details."/>
        </bitfield>
        <bitfield id="TA3RMP" description="Timer3_A3 remapping source selection" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="TA3RMP_0" value="0x0" description="Default function. See the device-specific data sheet for details."/>
            <bitenum id="TA3RMP_1" value="0x1" description="Remapped function. See the device-specific data sheet for details."/>
        </bitfield>
        <bitfield id="USCIB1RMP" description="eUSCI_B1 remapping source selection" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="USCIB1RMP_0" value="0x0" description="Default function. See the device-specific data sheet for details."/>
            <bitenum id="USCIB1RMP_1" value="0x1" description="Remapped function. See the device-specific data sheet for details."/>
        </bitfield>
    </register>
</module>
